#+TODO: TODO WIP CAD PRINT LANG | DONE

* WIP first prototype sourcing

** 3d printed parts

| Part                                        | quantity | State | STL                                                       | CAD                          | Notes                                                                                              |
|---------------------------------------------+----------+-------+-----------------------------------------------------------+------------------------------+----------------------------------------------------------------------------------------------------|
| Open builds-inspired 20x20 vslot 26cm       |       12 | DONE  | [[./STL/vslot2020-26cm.stl]]                                  | [[./CAD/vslot2020.FCStd]]        | TODO: parametrize with freeCAD so it isn't only 2020 vslot                                         |
| Corner bracket                              |       24 | DONE  | [[./STL/corner-bracket-20x20xM3.2.stl]]                       | [[./CAD/bracket.FCStd]]          | TODO: Parametrize in the same spreadshit as the extrusion one, for it only serves to unite corners |
| Motor mount                                 |        8 | DONE  | [[./STL/nema17-mount.stl]]                                    | [[./CAD/motor_mount_try1.FCStd]] |                                                                                                    |
| Reel                                        |        8 | DONE  | [[./STL/reel2-5rounds-5.4diam4.55flat.stl]]                   | [[./CAD/reel2.FCStd]]            | LANG: what is it? a reel or a spool? and in spanish?                                               |
| Pulley                                      |        8 | DONE  | [[./STL/pulleyB-Pulley4.stl]]                                 | [[./CAD/pulleyB.FCStd]]          |                                                                                                    |
| FixedSupport                                |        8 | DONE  | [[./STL/pulleyB-FixedSupport2.stl]]                           | [[./CAD/pulleyB.FCStd]]          |                                                                                                    |
| RotatingSupport                             |        8 | DONE  | [[./STL/pulleyB-RotatingSupport5.stl]]                        | [[./CAD/pulleyB.FCStd]]          |                                                                                                    |
| Nut covers (optional)                       |       16 | DONE  | [[./STL/nut-tests-innerDiam3.4-NutWidth2.35-NutSize5.62.stl]] | [[./CAD/nut-tests.FCStd]]        | Just aesthetical anc convenient for a couple of nuts in the pulleys                                |
| Head moving Support                         |        1 |       |                                                           |                              |                                                                                                    |
| PSU Support                                 |        1 |       |                                                           |                              |                                                                                                    |
| Board supports                              |          |       |                                                           |                              |                                                                                                    |
| Box closures for CNC and vinilo             |        5 |       |                                                           |                              | TODO: at least one for the boards side, A second for  the PSU side at least                        |
| vslot t-nut adaptor for 3mm nuts (optional) |       72 | DONE  | https://www.thingiverse.com/thing:3050607/files           | MISSING                      | TODO: replace with a CAD parametric one, this one is creative commons but non-commercial           |
| Distance tool (optional)                    |      0-1 | DONE  | [[./STL/DistanceTool-Body.stl]]                               | [[./CAD/DistanceTool.FCStd]]     | Convenience tool to easily place the motors in place.                                              |

* (vitamins/printed/CNCed) Some of the parts can be done in metal too

| Part                                      | quantity | STL | CAD | Notes |
|-------------------------------------------+----------+-----+-----+-------|
| Open builds-aluminum 20x20 vslot XxYxZ cm |       12 |     |     |       |
| Corner brackets                           |       24 |     |     |       |
| t-nuts 3 mm diameter (for 2020 v/t-slot)  |       72 |     |     |       |

** vitamins (parts that cannot be 3d printed, in reprap jargon)

| name                                    | model                       | brand         | units | price (unit) | price (total) | unit | Sourcing                                                                       |
|-----------------------------------------+-----------------------------+---------------+-------+--------------+---------------+------+--------------------------------------------------------------------------------|
| stepper motors (x8)                     | 17HS19-2004S1 NEMA 17       | StepperOnline |    10 |       10.164 |        101.64 | eur  | https://www.amazon.es/gp/product/B07CPQC1Y6/ref=ppx_yo_dt_b_asin_title_o09_s00 |
| stepper motor controllers (x8)          | TMC2209 V2.0                | TMC           |    10 |        6.996 |         69.96 | eur  | https://www.amazon.es/gp/product/B085WZYK1T/ref=ppx_yo_dt_b_asin_title_o07_s00 |
| main board                              | STM32F429ZGT6 (Octopus Pro) | BIGTREETECH   |     1 |        92.99 |         92.99 | eur  | https://www.amazon.es/gp/product/B09JC2NR1L/ref=ppx_yo_dt_b_asin_title_o07_s01 |
| Power Source Unit (PSU)                 | LRS-200-24                  | MEANWELL      |     1 |        19.86 |         19.86 | eur  | https://www.amazon.es/gp/product/B07F29RHNP/ref=ppx_yo_dt_b_asin_title_o03_s01 |
| bearings 633z (3mm x 13mm x 5 mm) (x16) | 633z (3mm x 13mm x 5 mm)    |               |    20 |        1.372 |         27.44 | eur  | https://www.makerbeam.com/makerbeam-bearings-10p-for-makerbeam.html            |
|-----------------------------------------+-----------------------------+---------------+-------+--------------+---------------+------+--------------------------------------------------------------------------------|
| Total                                   |                             |               |       |              |        311.89 | eur  |                                                                                |
#+TBLFM: $6=$4*$5::@>$6=vsum(@2$6..@-1$6)

** Vitamins cheap/quantity

If you find one provider, he will be happy to sell you more of thse, how many do you need, again?

| name                  | model                | brand | units | price (unit) | price (total) | unit | Sourcing                                                                       |
|-----------------------+----------------------+-------+-------+--------------+---------------+------+--------------------------------------------------------------------------------|
| M3 screws 8 mm        |                      |       |    56 |              |             0 |      | https://www.amazon.es/gp/product/B07FL4G1DZ/ref=ppx_yo_dt_b_asin_title_o03_s01 |
| M3 screws 5 mm        |                      |       |    32 |              |             0 |      |                                                                                |
| M3 screws 14 mm       |                      |       |       |              |             0 |      | https://www.amazon.es/gp/product/B01AXUS4JU/ref=ppx_yo_dt_b_asin_title_o01_s02 |
| Cables and connectors | various TODO specify |       |       |              |             0 | eur  |                                                                                |
| Tools                 | various TODO specify |       |       |              |             0 | eur  |                                                                                |
|-----------------------+----------------------+-------+-------+--------------+---------------+------+--------------------------------------------------------------------------------|
| Total                 |                      |       |       |              |             0 | eur  |                                                                                |
#+TBLFM: $6=$4*$5::@>$6=vsum(@2$6..@-1$6)

REM spectra and dyneema lines
